<div class="text text_p-small text_default text_bold">Описание/Пошаговая инструкция выполнения домашнего задания:</div>

<div class="text text_p-small text_default learning-markdown js-learning-markdown"><ol>
<li>создайте новый кластер PostgresSQL 14 </li>
<li>зайдите в созданный кластер под пользователем postgres</li>
<li>создайте новую базу данных testdb</li>
<li>зайдите в созданную базу данных под пользователем postgres</li>
<li>создайте новую схему testnm</li>
<li>создайте новую таблицу t1 с одной колонкой c1 типа integer</li>
<li>вставьте строку со значением c1=1</li>
<li>создайте новую роль readonly</li>
<li>дайте новой роли право на подключение к базе данных testdb</li>
<li>дайте новой роли право на использование схемы testnm</li>
<li>дайте новой роли право на select для всех таблиц схемы testnm</li>
<li>создайте пользователя testread с паролем test123</li>
<li>дайте роль readonly пользователю testread</li>
<li>зайдите под пользователем testread в базу данных testdb</li>
<li>сделайте select * from t1;</li>
<li>получилось? (могло если вы делали сами не по шпаргалке и не упустили один существенный момент про который позже)</li>
<li>напишите что именно произошло в тексте домашнего задания</li>
<li>у вас есть идеи почему? ведь права то дали?</li>
<li>посмотрите на список таблиц</li>
<li>подсказка в шпаргалке под пунктом 20</li>
<li>а почему так получилось с таблицей (если делали сами и без шпаргалки то может у вас все нормально)</li>
<li>вернитесь в базу данных testdb под пользователем postgres</li>
<li>удалите таблицу t1</li>
<li>создайте ее заново но уже с явным указанием имени схемы testnm</li>
<li>вставьте строку со значением c1=1</li>
<li>зайдите под пользователем testread в базу данных testdb</li>
<li>сделайте select * from testnm.t1;</li>
<li>получилось?</li>
<li>есть идеи почему? если нет - смотрите шпаргалку</li>
<li>как сделать так чтобы такое больше не повторялось? если нет идей - смотрите шпаргалку</li>
<li>сделайте select * from testnm.t1;</li>
<li>получилось?</li>
<li>есть идеи почему? если нет - смотрите шпаргалку</li>
<li>сделайте select * from testnm.t1;</li>
<li>получилось?</li>
<li>ура!</li>
<li>теперь попробуйте выполнить команду create table t2(c1 integer); insert into t2 values (2);</li>
<li>а как так? нам же никто прав на создание таблиц и insert в них под ролью readonly?</li>
<li>есть идеи как убрать эти права? если нет - смотрите шпаргалку</li>
<li>если вы справились сами то расскажите что сделали и почему, если смотрели шпаргалку - объясните что сделали и почему выполнив указанные в ней команды</li>
<li>теперь попробуйте выполнить команду create table t3(c1 integer); insert into t2 values (2);</li>
<li>расскажите что получилось и почему  </li>
</ol>
</div>
